# SetVPClOvrdLnWeight

```pascal
PROCEDURE SetVPClOvrdLnWeight(
				viewportHandle : HANDLE;
				className      : STRING;
				LineWeight     : INTEGER);
```

```python
def vs.SetVPClOvrdLnWeight(viewportHandle, className, LineWeight):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle|
|className|STRING|The name of the class override|
|LineWeight|INTEGER|The lineWeight to be set|

## Version
Availability: from Vectorworks 2018

## Category
* Viewports